{
  "testimonials": [
    {"id": 1, "name": "Rachel P.", "location": "{{city}}, {{state}}", "rating": 5, "text": "{{businessName}} completely transformed our backyard into a desert oasis with native plants, a flagstone patio, and landscape lighting throughout. The design team listened to every detail of what we wanted and stayed within our budget. We have been enjoying the space almost every evening since it was finished — it honestly feels like a resort back there.", "service": "Landscape Design", "date": "2024-11-08", "verified": true},
    {"id": 2, "name": "Mark L.", "location": "{{city}}, {{state}}", "rating": 5, "text": "Best lawn care service in {{city}}, hands down. Our yard has never looked this healthy or this green. The crew shows up on time every single week, edges everything perfectly, and cleans up before they leave. Our neighbors have actually asked us who we use because the difference from what we had before is night and day.", "service": "Lawn Maintenance", "date": "2024-10-12", "verified": true},
    {"id": 3, "name": "Susan D.", "location": "{{city}}, {{state}}", "rating": 5, "text": "We hired {{businessName}} to install a xeriscape garden in our front yard and the results are stunning. They replaced our water-hungry lawn with drought-tolerant plants, decorative gravel, and a drip irrigation system. Our water bill dropped by about 70 percent and the yard looks better than it ever did with grass. Their knowledge of desert-adapted plants really shows.", "service": "Xeriscaping", "date": "2024-09-18", "verified": true},
    {"id": 4, "name": "Frank B.", "location": "{{city}}, {{state}}", "rating": 5, "text": "{{businessName}} built us a beautiful paver patio with a custom fire pit and an outdoor kitchen area with a built-in grill and bar counter. The craftsmanship on the stonework is exceptional — every detail was done right. We have hosted family dinners and weekend barbecues out there all season. Easily the best home investment we have ever made.", "service": "Hardscaping", "date": "2024-08-22", "verified": true},
    {"id": 5, "name": "Carol W.", "location": "{{city}}, {{state}}", "rating": 5, "text": "They installed a complete drip irrigation system with a smart controller for our entire property, including all the garden beds and tree zones. The installation was clean and professional, and our water bill has been cut nearly in half since. The technician took time to walk us through how to use the controller and adjust zones seasonally. Very knowledgeable and very thorough.", "service": "Irrigation", "date": "2024-07-15", "verified": true}
  ],
  "summary": {"averageRating": "4.9", "totalReviews": "456"}
}