{
  "testimonials": [
    {"id": 1, "name": "Jennifer M.", "location": "{{city}}, {{state}}", "rating": 5, "text": "{{businessName}} completely transformed my home after I came back from a two-week vacation. Every surface was gleaming, the bathrooms smelled amazing, and they even organized the items on my kitchen counters neatly. I was honestly speechless when I walked through the door. This is the cleanest my house has ever been, and I have lived here for twelve years.", "service": "Deep Cleaning", "date": "2024-11-20", "verified": true},
    {"id": 2, "name": "Robert K.", "location": "{{city}}, {{state}}", "rating": 5, "text": "We have tried at least four different cleaning services in {{city}} over the past few years, and {{businessName}} is by far the best. Their team is thorough, professional, and genuinely trustworthy. They pay attention to details that other companies skip entirely, like wiping down light switches and cleaning behind the toilet. We are now on a biweekly plan and could not be happier.", "service": "Regular Cleaning", "date": "2024-10-15", "verified": true},
    {"id": 3, "name": "Amanda T.", "location": "{{city}}, {{state}}", "rating": 5, "text": "As an Airbnb host with three properties in {{city}}, I need fast and reliable turnovers between guests. {{businessName}} has never let me down, even with last-minute requests. They handle everything from fresh linens to restocking toiletries. My guests consistently mention how spotless the place is in their reviews, and my ratings have gone up since I started working with this team.", "service": "Vacation Rental", "date": "2024-09-28", "verified": true},
    {"id": 4, "name": "Michael S.", "location": "{{city}}, {{state}}", "rating": 5, "text": "We just finished a full kitchen remodel and the construction dust was absolutely everywhere, coating every surface in the house including rooms that were supposedly sealed off. {{businessName}}'s post-construction team came in and made the entire house look like new in a single day. They cleaned inside cabinets, wiped down every window, and even got dust out of the HVAC vents. Incredible work.", "service": "Post-Construction", "date": "2024-08-10", "verified": true},
    {"id": 5, "name": "Lisa H.", "location": "{{city}}, {{state}}", "rating": 5, "text": "Moving out of my apartment after three years was incredibly stressful, and cleaning was the last thing I wanted to deal with. {{businessName}} handled the entire move-out clean while I focused on the actual move. They scrubbed the oven, cleaned inside every cabinet, and left the bathroom sparkling. My landlord was impressed, and I got my full security deposit back without any issues.", "service": "Move-Out Cleaning", "date": "2024-07-22", "verified": true}
  ],
  "summary": {"averageRating": "4.9", "totalReviews": "512"}
}
