{
  "primaryServiceArea": "Denver Area",
  "serviceRadius": "We serve Denver and surrounding Front Range communities within 25 miles",
  "areas": [
    {
      "slug": "denver",
      "name": "Denver",
      "state": "CO",
      "population": "730,000+",
      "coordinates": { "lat": 39.7392, "lng": -104.9903 },
      "description": "{{businessName}} serves homeowners and businesses across {{city}}, from Capitol Hill Victorian renovations to new construction in RiNo. Our licensed electricians know Denver's diverse housing stock and the electrical challenges that come with it.",
      "neighborhoods": ["Capitol Hill", "Washington Park", "Highland", "RiNo", "Baker", "Stapleton"],
      "landmarks": ["Red Rocks Amphitheatre", "Denver Union Station", "Coors Field", "Denver Art Museum"],
      "localChallenges": "Denver's neighborhoods are full of homes built in the 1940s–1970s with original knob-and-tube or aluminum wiring that poses a serious safety risk. At 5,280 feet elevation, electrical equipment runs differently and outdoor fixtures must withstand heavy snow loads, ice storms, and temperature swings of 50°F or more in a single day. Denver's rapid growth has driven heavy demand for EV charger and solar integration work.",
      "serviceHighlights": [
        "Knob-and-tube and aluminum wiring replacement",
        "EV charger installation — Level 2 home charging stations",
        "Panel upgrades to 200A for older Denver homes"
      ]
    },
    {
      "slug": "aurora",
      "name": "Aurora",
      "state": "CO",
      "population": "390,000+",
      "coordinates": { "lat": 39.7294, "lng": -104.8319 },
      "description": "Aurora is one of Colorado's largest cities and home to a diverse mix of older bungalows, mid-century ranch homes, and newer developments. {{businessName}} provides dependable electrical service across all of Aurora.",
      "neighborhoods": ["Stapleton", "Centretech", "Saddle Rock", "Heather Ridge", "Murphy Creek", "Tallyn's Reach"],
      "landmarks": ["Aurora Reservoir", "Denver International Airport", "Buckley Space Force Base", "Stanley Marketplace"],
      "localChallenges": "Aurora's older west-side neighborhoods near Colfax have significant concentrations of aging Federal Pacific and Zinsco panels that are known fire hazards. Winter storms regularly damage outdoor service entrances and weatherheads. The city's large military and veteran population at Buckley often needs fast, trustworthy service with security-conscious crews.",
      "serviceHighlights": [
        "Federal Pacific and Zinsco panel replacement",
        "Storm damage repair and outdoor service entrance restoration",
        "Whole-home rewire for mid-century ranch homes"
      ]
    },
    {
      "slug": "lakewood",
      "name": "Lakewood",
      "state": "CO",
      "population": "160,000+",
      "coordinates": { "lat": 39.7047, "lng": -105.0814 },
      "description": "Lakewood's mix of 1960s ranch homes, newer townhomes, and Belmar-area condos keeps {{businessName}} busy year-round. We understand the electrical systems common to Jefferson County and bring honest, licensed work to every job.",
      "neighborhoods": ["Belmar", "Morse Park", "Green Mountain", "Applewood", "Estes", "Westland"],
      "landmarks": ["Red Rocks Park", "Belmar Shopping District", "Bear Creek Lake Park", "Colorado Mills Mall"],
      "localChallenges": "Lakewood has a large inventory of post-war tract homes with original 100A panels that can no longer support modern appliances, EV chargers, and home offices simultaneously. Altitude and freeze-thaw cycles stress outdoor conduit and underground feeder runs. Many Applewood-area homes still have ungrounded two-prong outlets that violate current code requirements.",
      "serviceHighlights": [
        "Panel upgrades from 100A to 200A or 400A service",
        "Grounding and GFCI/AFCI outlet upgrades throughout the home",
        "Outdoor lighting and weatherproof outlet installation"
      ]
    },
    {
      "slug": "arvada",
      "name": "Arvada",
      "state": "CO",
      "population": "120,000+",
      "coordinates": { "lat": 39.8028, "lng": -105.0875 },
      "description": "From Olde Town Arvada's historic homes to newer subdivisions near Candelas, {{businessName}} brings licensed electrical expertise to every corner of the city. Arvada homeowners trust us for straightforward pricing and work done right the first time.",
      "neighborhoods": ["Olde Town Arvada", "Candelas", "Ralston Valley", "West Woods", "Pomona", "Oberon"],
      "landmarks": ["Olde Town Arvada", "Majestic View Nature Center", "Arvada Center for the Arts", "Stenger Soccer Complex"],
      "localChallenges": "Arvada's older Olde Town neighborhoods feature homes built in the early 1900s, many still with original 60A service panels and cloth-wrapped wiring. The city's rapid westward expansion toward the mountains means newer homes are integrating solar, battery backup, and EV charging simultaneously — requiring careful load management. Snow and ice on roof-mounted fixtures and satellite equipment frequently damages service entrances in winter.",
      "serviceHighlights": [
        "Historic home rewire with minimal drywall disruption",
        "Solar-ready panel upgrades and battery backup installation",
        "Service entrance and weatherhead replacement after storm damage"
      ]
    },
    {
      "slug": "centennial",
      "name": "Centennial",
      "state": "CO",
      "population": "110,000+",
      "coordinates": { "lat": 39.5807, "lng": -104.8769 },
      "description": "Centennial is one of Colorado's newest cities, but its housing stock spans several decades. {{businessName}} serves Centennial homeowners with the electrical expertise their homes deserve — from 1980s subdivisions to custom builds near Cherry Creek State Park.",
      "neighborhoods": ["Willow Creek", "Foxridge", "Piney Creek", "Smoky Hill", "Homestead Farm", "Cherry Knolls"],
      "landmarks": ["Cherry Creek State Park", "Arapahoe County Fairgrounds", "Streets at SouthGlenn", "Centennial Airport"],
      "localChallenges": "Centennial's 1970s–1990s homes frequently have aluminum branch wiring, which requires special connectors and outlet devices to meet code safely. The suburban density means underground utility work requires careful coordination with HOAs and the city. Centennial's high altitude and dry climate cause static discharge issues in finished basements without proper grounding.",
      "serviceHighlights": [
        "Aluminum wiring remediation and CO/ALR outlet upgrades",
        "EV charger installation in attached and detached garages",
        "Basement finishing electrical — circuits, recessed lighting, home theater"
      ]
    },
    {
      "slug": "boulder",
      "name": "Boulder",
      "state": "CO",
      "population": "105,000+",
      "coordinates": { "lat": 40.0150, "lng": -105.2705 },
      "description": "Boulder's progressive community leads the state in solar adoption, EV ownership, and energy-efficient home upgrades. {{businessName}} brings the licensed electrical expertise to match Boulder's forward-thinking approach to energy.",
      "neighborhoods": ["University Hill", "Mapleton Hill", "Whittier", "Newlands", "Martin Acres", "Table Mesa"],
      "landmarks": ["Flatirons", "Pearl Street Mall", "University of Colorado Boulder", "Chautauqua Park"],
      "localChallenges": "Boulder's historic neighborhoods on Mapleton Hill and University Hill have some of the oldest wiring in the Front Range — knob-and-tube is still found in basements throughout the area. Xcel Energy's Boulder service territory has strict interconnect requirements for solar installations. At over 5,400 feet elevation, outdoor electrical fixtures face extreme UV exposure, freeze-thaw cycles, and occasional 100+ mph Chinook winds.",
      "serviceHighlights": [
        "Solar-ready panel upgrades and Xcel interconnect compliance",
        "Whole-home rewire for historic Boulder bungalows",
        "EV charger installation — Tesla, ChargePoint, and universal J1772"
      ]
    }
  ]
}
