{
  "testimonials": [
    {"id": 1, "name": "Angela R.", "location": "{{city}}, {{state}}", "rating": 5, "text": "{{businessName}} rewired our entire 1960s home and the quality of work was outstanding. They labeled every breaker clearly, patched drywall where they needed access, and left the house cleaner than they found it. The city inspector said it was one of the best rewiring jobs he'd seen. We finally feel safe in our home.", "service": "Whole Home Rewiring", "date": "2024-11-18", "verified": true},
    {"id": 2, "name": "Steven C.", "location": "{{city}}, {{state}}", "rating": 5, "text": "Had a circuit breaker that kept tripping every time we ran the microwave and toaster together. {{businessName}} discovered a previous contractor had put the entire kitchen on one 15-amp circuit — way undersized. They split it into three properly sized circuits with a small panel upgrade. No more trips, and they explained every step so I understood what was happening.", "service": "Panel Upgrade", "date": "2024-10-22", "verified": true},
    {"id": 3, "name": "Diana F.", "location": "{{city}}, {{state}}", "rating": 5, "text": "We hired {{businessName}} to install landscape lighting and new outdoor outlets as part of our patio remodel. The electrician actually walked the yard with us to plan fixture placement for the best visual effect. Everything is on timers and dimmers, the install was clean, and our backyard looks amazing at night. Truly a professional team that takes pride in their work.", "service": "Outdoor Lighting", "date": "2024-09-15", "verified": true},
    {"id": 4, "name": "Ray T.", "location": "{{city}}, {{state}}", "rating": 5, "text": "Power went out in half the house during a monsoon and I was worried it would be days before anyone could come. {{businessName}} had an electrician at our door within two hours on a Saturday evening. Turned out a breaker had failed from a surge. They replaced it on the spot, tested everything, and even installed a whole-home surge protector while they were at it. Incredible service.", "service": "Emergency Service", "date": "2024-08-20", "verified": true},
    {"id": 5, "name": "Linda S.", "location": "{{city}}, {{state}}", "rating": 5, "text": "Getting our Tesla Wall Connector installed was completely painless thanks to {{businessName}}. They checked our panel capacity, determined we needed a 200-amp upgrade, handled the permit, did both the panel and charger install in one visit, and scheduled the inspection. We went from zero EV charging capability to a fully permitted Level 2 setup in a single day. Highly recommend.", "service": "EV Charger Install", "date": "2024-07-10", "verified": true}
  ],
  "summary": {"averageRating": "4.8", "totalReviews": "534"}
}
