{
  "testimonials": [
    {"id": 1, "name": "Bill M.", "location": "{{city}}, {{state}}", "rating": 5, "text": "{{businessName}} replaced our entire roof after monsoon damage. The insurance claim process was a nightmare, but their team handled everything with the adjuster from start to finish. They documented all the damage, got us fair coverage, and the new roof looks incredible. The crew was professional, cleaned up every day, and finished ahead of schedule. Could not ask for more.", "service": "Roof Replacement", "date": "2024-11-10", "verified": true},
    {"id": 2, "name": "Sandra W.", "location": "{{city}}, {{state}}", "rating": 5, "text": "Found a leak in our bedroom ceiling after a big storm and called {{businessName}} first thing in the morning. They had a crew out by 10 AM, found the problem in a damaged piece of flashing around the chimney, and had it repaired before the next round of rain hit that afternoon. Fast, professional, and reasonably priced. They saved us from what could have been serious water damage.", "service": "Roof Repair", "date": "2024-10-05", "verified": true},
    {"id": 3, "name": "Greg T.", "location": "{{city}}, {{state}}", "rating": 5, "text": "We got quotes from four different roofers before choosing {{businessName}}. They were not the cheapest, but they were by far the most thorough in their inspection. They climbed up, took photos of everything, and sat down with us to explain what we actually needed versus what we did not. No pressure, no upselling. That kind of honesty is rare and we felt confident trusting them with the job.", "service": "Roof Inspection", "date": "2024-09-20", "verified": true},
    {"id": 4, "name": "Helen P.", "location": "{{city}}, {{state}}", "rating": 5, "text": "Had {{businessName}} install a cool roof coating on our flat commercial building downtown. The difference has been remarkable. The building is noticeably cooler during summer months and our energy bills dropped by nearly 20 percent. The crew worked around our business hours so there was zero disruption to our tenants. Great investment and great service from a company that clearly knows commercial roofing.", "service": "Roof Coating", "date": "2024-08-15", "verified": true},
    {"id": 5, "name": "Joe R.", "location": "{{city}}, {{state}}", "rating": 5, "text": "{{businessName}} has been doing our annual roof maintenance for three years now. Every visit, they send detailed photos of what they find and take the time to explain everything in plain language. They caught a small issue with our ridge vent last year that could have turned into a major problem. No high-pressure sales tactics, just honest assessments and fair pricing. Highly recommend their maintenance program to any homeowner in {{city}}.", "service": "Maintenance", "date": "2024-07-08", "verified": true}
  ],
  "summary": {"averageRating": "4.8", "totalReviews": "389"}
}
